locksmith/__tests__/payment/fixtures/paymentProcessor/connected_account_charged_user.json

[
    {
        "scope": "https://api.stripe.com:443",
        "method": "POST",
        "path": "/v1/charges",
        "body": "amount=25000&currency=USD&customer=cus_H669IyGrYp85kA&metadata[lock]=0xf5d0c1cfe659902f9abae67a70d5923ef8dbc1dc&metadata[publicKey]=0x9409bd2f87f0698f89c04caee8ddb2fd9e44bcc3&application_fee_amount=2500",
        "status": 200,
        "response": {
            "id": "ch_1GXusbL9eCzn3mEifTKZtZWx",
            "object": "charge",
            "amount": 25000,
            "amount_refunded": 0,
            "application": "ca_H61yawo09hdDhxKVN5PfqfYlxuJ6WCWD",
            "application_fee": "fee_1GXuscL9eCzn3mEiAdZEDP4J",
            "application_fee_amount": 2500,
            "balance_transaction": "txn_1GXuscL9eCzn3mEi3hs89uXV",
            "billing_details": {
                "address": {
                    "city": null,
                    "country": "US",
                    "line1": null,
                    "line2": null,
                    "postal_code": null,
                    "state": null
                },
                "email": null,
                "name": null,
                "phone": null
            },
            "calculated_statement_descriptor": "WWW.UNLOCK-PROTOCOL.CO",
            "captured": true,
            "created": 1586894229,
            "currency": "usd",
            "customer": "cus_H669IyGrYp85kA",
            "description": null,
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {},
            "invoice": null,
            "livemode": false,
            "metadata": {
                "lock": "0xf5d0c1cfe659902f9abae67a70d5923ef8dbc1dc",
                "publicKey": "0x9409bd2f87f0698f89c04caee8ddb2fd9e44bcc3"
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "risk_score": 34,
                "seller_message": "Payment complete.",
                "type": "authorized"
            },
            "paid": true,
            "payment_intent": null,
            "payment_method": "card_1GXu6AL9eCzn3mEifcnjtnWg",
            "payment_method_details": {
                "card": {
                    "brand": "visa",
                    "checks": {
                        "address_line1_check": null,
                        "address_postal_code_check": null,
                        "cvc_check": null
                    },
                    "country": "US",
                    "exp_month": 12,
                    "exp_year": 2024,
                    "fingerprint": "AFKXiqgyjbiUvf93",
                    "funding": "credit",
                    "installments": null,
                    "last4": "4242",
                    "network": "visa",
                    "three_d_secure": null,
                    "wallet": null
                },
                "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/acct_1GXsNrL9eCzn3mEi/ch_1GXusbL9eCzn3mEifTKZtZWx/rcpt_H676ZaAai2reZaZEclfFtyFTrI2lKes",
            "refunded": false,
            "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_1GXusbL9eCzn3mEifTKZtZWx/refunds"
            },
            "review": null,
            "shipping": null,
            "source": {
                "id": "card_1GXu6AL9eCzn3mEifcnjtnWg",
                "object": "card",
                "address_city": null,
                "address_country": "US",
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_H669IyGrYp85kA",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2024,
                "fingerprint": "AFKXiqgyjbiUvf93",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
            },
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
        },
        "rawHeaders": [
            "Server",
            "nginx",
            "Date",
            "Tue, 14 Apr 2020 19:57:10 GMT",
            "Content-Type",
            "application/json",
            "Content-Length",
            "3125",
            "Connection",
            "keep-alive",
            "access-control-allow-credentials",
            "true",
            "access-control-allow-methods",
            "GET, POST, HEAD, OPTIONS, DELETE",
            "access-control-allow-origin",
            "*",
            "access-control-expose-headers",
            "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
            "access-control-max-age",
            "300",
            "cache-control",
            "no-cache, no-store",
            "request-id",
            "req_T0PRHlprdWGK6r",
            "stripe-account",
            "acct_1GXsNrL9eCzn3mEi",
            "stripe-version",
            "2018-02-28",
            "Strict-Transport-Security",
            "max-age=31556926; includeSubDomains; preload"
        ],
        "responseIsBinary": false
    }
]